In [ ]:
data manipulation with pandas

In [24]:
#pandas series
import pandas as pd
S=pd.Series([1,3,5,7])

In [13]:
S

0    1
1    3
2    5
3    7
dtype: int64

In [17]:
S=pd.Series([1,9,4,7],index=['a','b','c','d'])

In [18]:
S

a    1
b    9
c    4
d    7
dtype: int64

In [16]:
#conda install pandas
#data frame (tabular format)
#empty data frame
x=pd.DataFrame()
x

Empty DataFrame
Columns: []
Index: []

In [20]:
l=['greek','portal','for']
pd.DataFrame(l)

        0
0   greek
1  portal
2     for

In [1]:
#create data frame using dictionary
data={'Name':['tom','dick','harry'],'age':[20,30,40]}

In [5]:
pd.DataFrame(data)

    Name  age
0    tom   20
1   dick   30
2  harry   40

In [6]:
#read csv file and excel file using pandas
?pd.read

Object `pd.read` not found.

In [15]:
#credit.csv
#pd.read_csv ("path of the file")
data=pd.read_csv("C://Users//Darren savio dsouza")

OSError: Initializing from file failed

In [61]:
import os
os.chdir("C://Users//Darren savio dsouza")

In [11]:
os.getcwd()

'C:\\Users\\Darren savio dsouza'

In [34]:
data=pd.read_csv("Credit.csv")

In [ ]:
# https://s3.us-east-2.amazonaws.com/datafaculty/CatalystClass/Python/candidates.csv

In [ ]:
data1=pd.read_excel("customers.xlsx")

In [22]:
path='https://s3.us-east-2.amazonaws.com/datafaculty/CatalystClass/Python/candidates.csv'

In [35]:
df=pd.read_csv(path)

In [36]:
type(df)

pandas.core.frame.DataFrame

In [37]:
df.head()

   id   first_name  last_name middle_name party
0  33       Joseph      Biden         NaN     D
1  36       Samuel  Brownback         NaN     R
2  34      Hillary    Clinton          R.     D
3  39  Christopher       Dodd          J.     D
4  26         John    Edwards         NaN     D

In [32]:
df.dtypes

id              int64
first_name     object
last_name      object
middle_name    object
party          object
dtype: object

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
id             17 non-null int64
first_name     17 non-null object
last_name      17 non-null object
middle_name    3 non-null object
party          17 non-null object
dtypes: int64(1), object(4)
memory usage: 760.0+ bytes

In [39]:
df['first_name'].head()

0         Joseph
1         Samuel
2        Hillary
3    Christopher
4           John
Name: first_name, dtype: object

In [40]:
df[['first_name','last_name']].head(2)

  first_name  last_name
0     Joseph      Biden
1     Samuel  Brownback

In [42]:
#iloc methods
#select rows and coumns by number index
df.iloc[0]

id                 33
first_name     Joseph
last_name       Biden
middle_name       NaN
party               D
Name: 0, dtype: object

In [43]:
df.head(2)

   id first_name  last_name middle_name party
0  33     Joseph      Biden         NaN     D
1  36     Samuel  Brownback         NaN     R

In [44]:
df.iloc[0][3]

nan

In [45]:
df.iloc[0:3]

   id first_name  last_name middle_name party
0  33     Joseph      Biden         NaN     D
1  36     Samuel  Brownback         NaN     R
2  34    Hillary    Clinton          R.     D

In [46]:
df.iloc[1,2]

'Brownback'

In [49]:
df.iloc[[1,2],[1,2]]

  first_name  last_name
1     Samuel  Brownback
2    Hillary    Clinton

In [51]:
df.iloc[0:6]

   id   first_name  last_name middle_name party
0  33       Joseph      Biden         NaN     D
1  36       Samuel  Brownback         NaN     R
2  34      Hillary    Clinton          R.     D
3  39  Christopher       Dodd          J.     D
4  26         John    Edwards         NaN     D
5  22      Rudolph   Giuliani         NaN     R

In [58]:
df.iloc[0:6,[2,3]]

   last_name middle_name
0      Biden         NaN
1  Brownback         NaN
2    Clinton          R.
3       Dodd          J.
4    Edwards         NaN
5   Giuliani         NaN

In [ ]:
#loc method
#To select rows and columns using labelled index
#https://s3.us-east-2.amazonaws.com/datafaculty/CatalystClass/Python/Store.csv

In [63]:
path='https://s3.us-east-2.amazonaws.com/datafaculty/CatalystClass/Python/Store.csv'

In [66]:
import pandas as pd
df1=pd.read_csv(path,encoding='latin')

In [67]:
df1.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [69]:
#filter the data by rows
#segment was consumer
#there are two ways
#1-logical indexation- [data['logical condition']]
#2-query method-[data.query('logical condition')]

In [70]:
#logical condition
df1[df1['Segment']=='Consumer'].head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [71]:
df1.query('Segment=="Consumer"').head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [74]:
#how many orders were placed for region south
#shape gives the size of the column and rows
df1[df1["Region"]=="South"].shape

(1620, 21)

In [75]:
df1[df1["Region"]=="South"].shape[0]

1620

In [76]:
type(df1[df1["Region"]=="South"].shape)

tuple

In [77]:
df1.query('Region=="South"').shape[1]

21

In [79]:
#how many orders were placed for region south and for segment consumers
#data[(l1)& (l2) & (l3)]
#data[(l1)/(l2)]

df1[(df1["Region"]=="South") & (df1["Segment"]=="Consumer")].shape

(838, 21)

In [80]:
df1[(df1["Region"]=="South") & (df1["Segment"]=="Consumer")].shape[0]

838

In [82]:
df1.query('Region=="South" & Segment=="Consumer"').shape[0]

838

In [ ]:
#findhow many transaction from regionsouth has a profit of >$50

In [83]:
df1.query('Region=="South" & Profit>50').shape[0]

323

In [87]:
#sorting the data
#sort_values() method to sort the values
#sort data by profit
df1.sort_values("Profit").head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
7772,7773,CA-2013-108196,11/26/2013,12/3/2013,Standard Class,CS-12505,Cindy Stewart,Consumer,United States,Lancaster,...,43130,East,TEC-MA-10000418,Technology,Machines,Cubify CubeX 3D Printer Double Head Print,4499.985,5,0.7,-6599.9780
683,684,US-2014-168116,11/5/2014,11/5/2014,Same Day,GT-14635,Grant Thornton,Corporate,United States,Burlington,...,27217,South,TEC-MA-10004125,Technology,Machines,Cubify CubeX 3D Printer Triple Head Print,7999.980,4,0.5,-3839.9904

In [86]:
df1.sort_values("Profit",ascending=False).head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
6826,6827,CA-2013-118689,10/3/2013,10/10/2013,Standard Class,TC-20980,Tamara Chand,Corporate,United States,Lafayette,...,47905,Central,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,17499.95,5,0.0,8399.9760
8153,8154,CA-2014-140151,3/24/2014,3/26/2014,First Class,RB-19360,Raymond Buch,Consumer,United States,Seattle,...,98115,West,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,13999.96,4,0.0,6719.9808

In [85]:
df1.sort_values("Profit",ascending=True).head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
7772,7773,CA-2013-108196,11/26/2013,12/3/2013,Standard Class,CS-12505,Cindy Stewart,Consumer,United States,Lancaster,...,43130,East,TEC-MA-10000418,Technology,Machines,Cubify CubeX 3D Printer Double Head Print,4499.985,5,0.7,-6599.9780
683,684,US-2014-168116,11/5/2014,11/5/2014,Same Day,GT-14635,Grant Thornton,Corporate,United States,Burlington,...,27217,South,TEC-MA-10004125,Technology,Machines,Cubify CubeX 3D Printer Triple Head Print,7999.980,4,0.5,-3839.9904

In [88]:
df1.sort_values(['Profit','Sales'],ascending=[False,True]).head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
6826,6827,CA-2013-118689,10/3/2013,10/10/2013,Standard Class,TC-20980,Tamara Chand,Corporate,United States,Lafayette,...,47905,Central,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,17499.95,5,0.0,8399.9760
8153,8154,CA-2014-140151,3/24/2014,3/26/2014,First Class,RB-19360,Raymond Buch,Consumer,United States,Seattle,...,98115,West,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,13999.96,4,0.0,6719.9808

In [89]:
df1.sort_values(['Profit','Sales'],ascending=[True,False]).head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
7772,7773,CA-2013-108196,11/26/2013,12/3/2013,Standard Class,CS-12505,Cindy Stewart,Consumer,United States,Lancaster,...,43130,East,TEC-MA-10000418,Technology,Machines,Cubify CubeX 3D Printer Double Head Print,4499.985,5,0.7,-6599.9780
683,684,US-2014-168116,11/5/2014,11/5/2014,Same Day,GT-14635,Grant Thornton,Corporate,United States,Burlington,...,27217,South,TEC-MA-10004125,Technology,Machines,Cubify CubeX 3D Printer Triple Head Print,7999.980,4,0.5,-3839.9904

In [92]:
#group by task (split data in groups based on some criteria)
#Find average profit by region
df1.groupby("Region").agg({"Profit":'mean'})

            Profit
Region
Central  17.092709
East     32.135808
South    28.857673
West     33.849032

In [93]:
df1.groupby("Region").agg({"Profit":'mean',"Discount":'min'})

            Profit  Discount
Region
Central  17.092709       0.0
East     32.135808       0.0
South    28.857673       0.0
West     33.849032       0.0

In [94]:
import numpy as np
df1.groupby(["Region","Ship Mode"]).agg({"Profit":np.mean,"Discount":np.min})

                           Profit  Discount
Region  Ship Mode
Central First Class     12.398887       0.0
        Same Day        12.765664       0.0
        Second Class    19.601795       0.0
        Standard Class  17.618055       0.0
East    First Class     32.106151       0.0
        Same Day        51.485594       0.0
        Second Class    20.353379       0.0
        Standard Class  34.084404       0.0
South   First Class     29.454638       0.0
        Same Day       -21.232952       0.0
        Second Class    44.580994       0.0
        Standard Class  27.671697       0.0
West    First Class     43.957618       0.0
        Same Day        44.010525       0.0
        Second Class    36.839554       0.0
        Standard Class  29.097219       0.0

In [97]:
#merging data frames
A=pd.DataFrame({'X1':['a','b','c'],'X2':[1,2,3]})

B=pd.DataFrame({'X1':['a','b','d'],'X3':[True,False,True]})

In [98]:
A

  X1  X2
0  a   1
1  b   2
2  c   3

In [99]:
B

  X1     X3
0  a   True
1  b  False
2  d   True

In [100]:
#left join
pd.merge(A,B,how='left',on='X1')

  X1  X2     X3
0  a   1   True
1  b   2  False
2  c   3    NaN

In [101]:
#right join
pd.merge(A,B,how='right',on='X1')

  X1   X2     X3
0  a  1.0   True
1  b  2.0  False
2  d  NaN   True

In [102]:
#inner join
pd.merge(A,B,how='inner',on='X1')

  X1  X2     X3
0  a   1   True
1  b   2  False

In [103]:
#outer join
pd.merge(A,B,how='outer',on='X1')

  X1   X2     X3
0  a  1.0   True
1  b  2.0  False
2  c  3.0    NaN
3  d  NaN   True

In [105]:
#missing values
#isnull().sum() to check the missing value
#fillna() method to impute them
data.isnull().sum()

NPA Status                                  2
RevolvingUtilizationOfUnsecuredLines        2
age                                         2
Gender                                      2
Region                                      2
MonthlyIncome                           29733
Rented_OwnHouse                             2
Occupation                                  2
Education                                   2
NumberOfTime30-59DaysPastDueNotWorse        2
DebtRatio                                   2
MonthlyIncome.1                         29733
NumberOfOpenCreditLinesAndLoans             2
NumberOfTimes90DaysLate                     2
NumberRealEstateLoansOrLines                2
NumberOfTime60-89DaysPastDueNotWorse        2
NumberOfDependents                       3924
Good_Bad                                    2
dtype: int64

In [112]:
data["MonthlyIncome"].mean()

6670.221237392844

In [116]:
data["MonthlyIncome"].fillna(data["MonthlyIncome"].mean(),inplace=True)

In [120]:
data["MonthlyIncome"].isnull().sum()

0

In [121]:
data["Gender"].unique()

array(['Male', 'Female', nan], dtype=object)

In [122]:
#dummies
pd.get_dummies(data["Gender"])

        Female  Male
0            0     1
1            1     0
2            1     0
3            1     0
4            0     1
5            1     0
6            1     0
7            1     0
8            1     0
9            1     0
10           0     1
11           1     0
12           1     0
13           1     0
14           1     0
15           0     1
16           1     0
17           0     1
18           1     0
19           1     0
20           1     0
21           0     1
22           1     0
23           1     0
24           1     0
25           1     0
26           1     0
27           0     1
28           1     0
29           1     0
...        ...   ...
149972       0     1
149973       0     1
149974       0     1
149975       0     1
149976       0     1
149977       0     1
149978       0     1
149979       0     1
149980       0     1
149981       0     1
149982       0     1
149983       0     1
149984       0     1
149985       0     1
149986       0     1
149987       0     1
149988       0     1
149989       0     1
149990       0     1
149991       0     1
149992       0     1
149993       0     1
149994       0     1
149995       0     1
149996       0     1
149997       0     1
149998       0     1
149999       0     1
150000       0     0
150001       0     0

[150002 rows x 2 columns]